[Killed] BlockStatement
src/GildenRose.ts:6:35
 export class GildedRose {
   items: Array<Item>;
 
-  constructor(items: Array<Item>) {
-    this.items = items;
-  }
+  constructor(items: Array<Item>) {}
 
   updateQuality(): Array<Item> {
killedBy: Gilded Rose should be in update quality of a normal product
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/GildenRose.ts:11:21
   }
 
   updateQuality(): Array<Item> {
-    for (let i = 0; i < this.items.length; i++) {
+    for (let i = 0; i <= this.items.length; i++) {
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
killedBy: Gilded Rose should be in update quality of a normal product
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] EqualityOperator
src/GildenRose.ts:11:21
   }
 
   updateQuality(): Array<Item> {
-    for (let i = 0; i < this.items.length; i++) {
+    for (let i = 0; i >= this.items.length; i++) {
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
killedBy: Gilded Rose should be in update quality of a normal product
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Item {
      "name": "Elixir of the Mongoose",

[Killed] BlockStatement
src/GildenRose.ts:12:115
 
   updateQuality(): Array<Item> {
     for (let i = 0; i < this.items.length; i++) {
-      if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-        if (this.items[i].quality > 0) {
-          if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-            this.items[i].quality = this.items[i].quality - 1
-          }
-        }
-      } else {
+      if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {} else {
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1
killedBy: Gilded Rose should be in update quality of a normal product
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Item {
      "name": "Elixir of the Mongoose",

[Killed] ConditionalExpression
src/GildenRose.ts:12:11
 
   updateQuality(): Array<Item> {
     for (let i = 0; i < this.items.length; i++) {
-      if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
+      if (false) {
         if (this.items[i].quality > 0) {
           if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
killedBy: Gilded Rose should be in update quality of a normal product
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Item {
      "name": "Elixir of the Mongoose",

[Killed] BlockStatement
src/GildenRose.ts:13:40
   updateQuality(): Array<Item> {
     for (let i = 0; i < this.items.length; i++) {
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-        if (this.items[i].quality > 0) {
-          if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-            this.items[i].quality = this.items[i].quality - 1
-          }
-        }
+        if (this.items[i].quality > 0) {}
       } else {
         if (this.items[i].quality < 50) {
killedBy: Gilded Rose should be in update quality of a normal product
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Item {
      "name": "Elixir of the Mongoose",

[Killed] EqualityOperator
src/GildenRose.ts:13:13
   updateQuality(): Array<Item> {
     for (let i = 0; i < this.items.length; i++) {
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-        if (this.items[i].quality > 0) {
+        if (this.items[i].quality <= 0) {
           if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
             this.items[i].quality = this.items[i].quality - 1
killedBy: Gilded Rose should be in update quality of a normal product
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Item {
      "name": "Elixir of the Mongoose",

[Killed] ConditionalExpression
src/GildenRose.ts:14:15
     for (let i = 0; i < this.items.length; i++) {
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
-          if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
+          if (false) {
             this.items[i].quality = this.items[i].quality - 1
           }
killedBy: Gilded Rose should be in update quality of a normal product
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Item {
      "name": "Elixir of the Mongoose",

[Killed] BlockStatement
src/GildenRose.ts:14:67
     for (let i = 0; i < this.items.length; i++) {
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
-          if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-            this.items[i].quality = this.items[i].quality - 1
-          }
+          if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {}
         }
       } else {
killedBy: Gilded Rose should be in update quality of a normal product
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Item {
      "name": "Elixir of the Mongoose",

[Killed] ArithmeticOperator
src/GildenRose.ts:15:37
       if (this.items[i].name != 'Aged Brie' && this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
         if (this.items[i].quality > 0) {
           if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-            this.items[i].quality = this.items[i].quality - 1
+            this.items[i].quality = this.items[i].quality + 1
           }
         }
killedBy: Gilded Rose should be in update quality of a normal product
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Item {
      "name": "Elixir of the Mongoose",

[Killed] BlockStatement
src/GildenRose.ts:18:14
             this.items[i].quality = this.items[i].quality - 1
           }
         }
-      } else {
-        if (this.items[i].quality < 50) {
-          this.items[i].quality = this.items[i].quality + 1
-          if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1
-              }
-            }
-            if (this.items[i].sellIn < 6) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1
-              }
-            }
-          }
-        }
-      }
+      } else {}
       if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
         this.items[i].sellIn = this.items[i].sellIn - 1;
killedBy: Gilded Rose should be in update quality of a Aged Brie
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Item {
      "name": "Aged Brie",

[Killed] ConditionalExpression
src/GildenRose.ts:19:13
           }
         }
       } else {
-        if (this.items[i].quality < 50) {
+        if (false) {
           this.items[i].quality = this.items[i].quality + 1
           if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
killedBy: Gilded Rose should be in update quality of a Aged Brie
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Item {
      "name": "Aged Brie",

[Killed] ArithmeticOperator
src/GildenRose.ts:20:35
         }
       } else {
         if (this.items[i].quality < 50) {
-          this.items[i].quality = this.items[i].quality + 1
+          this.items[i].quality = this.items[i].quality - 1
           if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
             if (this.items[i].sellIn < 11) {
killedBy: Gilded Rose should be in update quality of a Aged Brie
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Item {
      "name": "Aged Brie",

[Killed] EqualityOperator
src/GildenRose.ts:21:15
       } else {
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1
-          if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
+          if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
             if (this.items[i].sellIn < 11) {
               if (this.items[i].quality < 50) {
killedBy: Gilded Rose should be in update quality of a Aged Brie
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Item {
      "name": "Aged Brie",

[Killed] ConditionalExpression
src/GildenRose.ts:21:15
       } else {
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1
-          if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
+          if (true) {
             if (this.items[i].sellIn < 11) {
               if (this.items[i].quality < 50) {
killedBy: Gilded Rose should be in update quality of a Aged Brie
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Item {
      "name": "Aged Brie",

[NoCoverage] EqualityOperator
src/GildenRose.ts:22:17
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1
           if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].sellIn < 11) {
+            if (this.items[i].sellIn >= 11) {
               if (this.items[i].quality < 50) {
                 this.items[i].quality = this.items[i].quality + 1

[NoCoverage] BlockStatement
src/GildenRose.ts:22:44
         if (this.items[i].quality < 50) {
           this.items[i].quality = this.items[i].quality + 1
           if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].sellIn < 11) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1
-              }
-            }
+            if (this.items[i].sellIn < 11) {}
             if (this.items[i].sellIn < 6) {
               if (this.items[i].quality < 50) {

[NoCoverage] BlockStatement
src/GildenRose.ts:27:43
                 this.items[i].quality = this.items[i].quality + 1
               }
             }
-            if (this.items[i].sellIn < 6) {
-              if (this.items[i].quality < 50) {
-                this.items[i].quality = this.items[i].quality + 1
-              }
-            }
+            if (this.items[i].sellIn < 6) {}
           }
         }

[Killed] BlockStatement
src/GildenRose.ts:35:63
           }
         }
       }
-      if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-        this.items[i].sellIn = this.items[i].sellIn - 1;
-      }
+      if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {}
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != 'Aged Brie') {
killedBy: Gilded Rose should be in update quality of a normal product
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Item {
      "name": "Elixir of the Mongoose",

[Killed] ConditionalExpression
src/GildenRose.ts:35:11
           }
         }
       }
-      if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
+      if (false) {
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }
killedBy: Gilded Rose should be in update quality of a normal product
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Item {
      "name": "Elixir of the Mongoose",

[Killed] ArithmeticOperator
src/GildenRose.ts:36:32
         }
       }
       if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-        this.items[i].sellIn = this.items[i].sellIn - 1;
+        this.items[i].sellIn = this.items[i].sellIn + 1;
       }
       if (this.items[i].sellIn < 0) {
killedBy: Gilded Rose should be in update quality of a normal product
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Item {
      "name": "Elixir of the Mongoose",

[NoCoverage] ConditionalExpression
src/GildenRose.ts:39:13
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }
       if (this.items[i].sellIn < 0) {
-        if (this.items[i].name != 'Aged Brie') {
+        if (true) {
           if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
             if (this.items[i].quality > 0) {

[NoCoverage] ConditionalExpression
src/GildenRose.ts:39:13
         this.items[i].sellIn = this.items[i].sellIn - 1;
       }
       if (this.items[i].sellIn < 0) {
-        if (this.items[i].name != 'Aged Brie') {
+        if (false) {
           if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
             if (this.items[i].quality > 0) {

[NoCoverage] EqualityOperator
src/GildenRose.ts:40:15
       }
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != 'Aged Brie') {
-          if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
+          if (this.items[i].name == 'Backstage passes to a TAFKAL80ETC concert') {
             if (this.items[i].quality > 0) {
               if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {

[NoCoverage] ConditionalExpression
src/GildenRose.ts:40:15
       }
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != 'Aged Brie') {
-          if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
+          if (false) {
             if (this.items[i].quality > 0) {
               if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {

[NoCoverage] EqualityOperator
src/GildenRose.ts:41:17
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != 'Aged Brie') {
           if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].quality > 0) {
+            if (this.items[i].quality >= 0) {
               if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
                 this.items[i].quality = this.items[i].quality - 1

[NoCoverage] BlockStatement
src/GildenRose.ts:41:44
       if (this.items[i].sellIn < 0) {
         if (this.items[i].name != 'Aged Brie') {
           if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
-            if (this.items[i].quality > 0) {
-              if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
-                this.items[i].quality = this.items[i].quality - 1
-              }
-            }
+            if (this.items[i].quality > 0) {}
           } else {
             this.items[i].quality = this.items[i].quality - this.items[i].quality

[NoCoverage] ConditionalExpression
src/GildenRose.ts:42:19
         if (this.items[i].name != 'Aged Brie') {
           if (this.items[i].name != 'Backstage passes to a TAFKAL80ETC concert') {
             if (this.items[i].quality > 0) {
-              if (this.items[i].name != 'Sulfuras, Hand of Ragnaros') {
+              if (true) {
                 this.items[i].quality = this.items[i].quality - 1
               }

[NoCoverage] BlockStatement
src/GildenRose.ts:46:18
                 this.items[i].quality = this.items[i].quality - 1
               }
             }
-          } else {
-            this.items[i].quality = this.items[i].quality - this.items[i].quality
-          }
+          } else {}
         } else {
           if (this.items[i].quality < 50) {

[NoCoverage] ArithmeticOperator
src/GildenRose.ts:47:37
               }
             }
           } else {
-            this.items[i].quality = this.items[i].quality - this.items[i].quality
+            this.items[i].quality = this.items[i].quality + this.items[i].quality
           }
         } else {

[NoCoverage] BlockStatement
src/GildenRose.ts:49:16
           } else {
             this.items[i].quality = this.items[i].quality - this.items[i].quality
           }
-        } else {
-          if (this.items[i].quality < 50) {
-            this.items[i].quality = this.items[i].quality + 1
-          }
-        }
+        } else {}
       }
     }

[NoCoverage] BlockStatement
src/GildenRose.ts:50:43
             this.items[i].quality = this.items[i].quality - this.items[i].quality
           }
         } else {
-          if (this.items[i].quality < 50) {
-            this.items[i].quality = this.items[i].quality + 1
-          }
+          if (this.items[i].quality < 50) {}
         }
       }
