[NoCoverage] ArrayDeclaration
src/index.ts:8:15
 //   return JSON.parse(JSON.stringify(origin)) as Array<Item>;
 // }
 
-const items = [
-  new Item("Elixir of the Mongoose", 5, 7)
-];
+const items = [];
 
 const clone = items.map((e) => structuredClone(e))

[NoCoverage] ArrowFunction
src/index.ts:12:25
   new Item("Elixir of the Mongoose", 5, 7)
 ];
 
-const clone = items.map((e) => structuredClone(e))
+const clone = items.map(() => undefined)
 const gildedRose = new GildedRose(items);
 const result = gildedRose.updateQuality()
